updated to 3.10.4
